In [1]:
import numpy as np
import pandas as pd

In [3]:
s=pd.Series([1,2,3,np.nan,44,1])

In [4]:
s

0     1.0
1     2.0
2     3.0
3     NaN
4    44.0
5     1.0
dtype: float64

In [8]:
dates=pd.date_range('20171015',periods=6)

In [9]:
dates

DatetimeIndex(['2017-10-15', '2017-10-16', '2017-10-17', '2017-10-18',
               '2017-10-19', '2017-10-20'],
              dtype='datetime64[ns]', freq='D')

In [13]:
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=['a','b','c','d'])

In [14]:
df

                   a         b         c         d
2017-10-15  0.591855  1.259310 -0.195773 -0.403376
2017-10-16  0.007072 -0.856198 -0.994006 -0.305624
2017-10-17 -0.261527 -1.582781 -0.392525 -0.262878
2017-10-18 -1.050194 -0.098067  0.146304  1.176635
2017-10-19 -0.148423  0.996443 -2.146427  1.402447
2017-10-20 -1.200690 -0.060446  0.702976 -0.419114

In [16]:
df1=pd.DataFrame(np.arange(12).reshape((3,4)))

In [17]:
df1

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [20]:
df2=pd.DataFrame({'A':1.,
    'B':pd.Timestamp('20130102'),
    'C':pd.Series(1,index=list(range(4)),dtype='float32'),
    'D':np.array([3]*4,dtype='int32'),
    'E':pd.Categorical(["test","train","test","train"]),
    'F':'foo'
})

In [21]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [23]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [24]:
df2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [26]:
df2.columns

Index([u'A', u'B', u'C', u'D', u'E', u'F'], dtype='object')

In [27]:
df2.values

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']], dtype=object)

In [29]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [30]:
df2.T

,0,1,2,3
A,1,1,1,1
B,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00,2013-01-02 00:00:00
C,1,1,1,1
D,3,3,3,3
E,test,train,test,train
F,foo,foo,foo,foo

In [31]:
df2.sort_index(axis=1,ascending=False)#排序，ascending为False是到着排序反之亦然

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-02  1.0
1  foo  train  3  1.0 2013-01-02  1.0
2  foo   test  3  1.0 2013-01-02  1.0
3  foo  train  3  1.0 2013-01-02  1.0

In [35]:
df2.sort_values(by='E')#对单行排序

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
2  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [36]:
df3=pd.DataFrame(np.arange(24).reshape((6,4)),index=dates,columns=['A','B','C','D'])

In [38]:
df3

             A   B   C   D
2017-10-15   0   1   2   3
2017-10-16   4   5   6   7
2017-10-17   8   9  10  11
2017-10-18  12  13  14  15
2017-10-19  16  17  18  19
2017-10-20  20  21  22  23

In [39]:
df3['A']#单行打印

2017-10-15     0
2017-10-16     4
2017-10-17     8
2017-10-18    12
2017-10-19    16
2017-10-20    20
Freq: D, Name: A, dtype: int64

In [40]:
df3.A

2017-10-15     0
2017-10-16     4
2017-10-17     8
2017-10-18    12
2017-10-19    16
2017-10-20    20
Freq: D, Name: A, dtype: int64

In [51]:
df3[0:3]#切片打印

            A  B   C   D
2017-10-15  0  1   2   3
2017-10-16  4  5   6   7
2017-10-17  8  9  10  11

In [44]:
df3['20171015':'20171016']

            A  B  C  D
2017-10-15  0  1  2  3
2017-10-16  4  5  6  7

In [55]:
df3.loc['20171015']#按标签打印

A    0
B    1
C    2
D    3
Name: 2017-10-15 00:00:00, dtype: int64

In [56]:
df3.loc['20171015',['A','B']]

A    0
B    1
Name: 2017-10-15 00:00:00, dtype: int64

In [57]:
df3.iloc[3,1] #按序列号打印

13

In [59]:
df3.ix[:3,['A','C']] #标签和序列号一起打印

            A   C
2017-10-15  0   2
2017-10-16  4   6
2017-10-17  8  10

In [62]:
df3[df3.A<6]#按照A列values小于6筛选，并且显示其他列

            A  B  C  D
2017-10-15  0  1  2  3
2017-10-16  4  5  6  7

In [63]:
df3.iloc[2,2]=1111#赋值

In [64]:
df3

             A   B     C   D
2017-10-15   0   1     2   3
2017-10-16   4   5     6   7
2017-10-17   8   9  1111  11
2017-10-18  12  13    14  15
2017-10-19  16  17    18  19
2017-10-20  20  21    22  23

In [65]:
df3[df3.A>8]=0

In [66]:
df3

            A  B     C   D
2017-10-15  0  1     2   3
2017-10-16  4  5     6   7
2017-10-17  8  9  1111  11
2017-10-18  0  0     0   0
2017-10-19  0  0     0   0
2017-10-20  0  0     0   0

In [69]:
df3.A[df3.A<8]=1

In [70]:
df3

            A  B     C   D
2017-10-15  1  1     2   3
2017-10-16  1  5     6   7
2017-10-17  8  9  1111  11
2017-10-18  1  0     0   0
2017-10-19  1  0     0   0
2017-10-20  1  0     0   0

In [71]:
df3['F']=np.nan#添加一个列

In [72]:
df3

            A  B     C   D   F
2017-10-15  1  1     2   3 NaN
2017-10-16  1  5     6   7 NaN
2017-10-17  8  9  1111  11 NaN
2017-10-18  1  0     0   0 NaN
2017-10-19  1  0     0   0 NaN
2017-10-20  1  0     0   0 NaN

In [74]:
df3['E']=pd.Series([1,2,3,4,5,6],index=pd.date_range('20171015',periods=6))

In [75]:
df3

            A  B     C   D   F  E
2017-10-15  1  1     2   3 NaN  1
2017-10-16  1  5     6   7 NaN  2
2017-10-17  8  9  1111  11 NaN  3
2017-10-18  1  0     0   0 NaN  4
2017-10-19  1  0     0   0 NaN  5
2017-10-20  1  0     0   0 NaN  6

In [78]:
df4=pd.DataFrame(np.arange(24).reshape((6,4)),index=dates,columns=['A','B','C','D'])
df4.iloc[0,1]=np.nan
df4.iloc[1,2]=np.nan

In [79]:
df4

             A     B     C   D
2017-10-15   0   NaN   2.0   3
2017-10-16   4   5.0   NaN   7
2017-10-17   8   9.0  10.0  11
2017-10-18  12  13.0  14.0  15
2017-10-19  16  17.0  18.0  19
2017-10-20  20  21.0  22.0  23

In [80]:
df4.dropna(axis=0,how='any')#how=['any','all']

             A     B     C   D
2017-10-17   8   9.0  10.0  11
2017-10-18  12  13.0  14.0  15
2017-10-19  16  17.0  18.0  19
2017-10-20  20  21.0  22.0  23

In [81]:
df4.isnull()

                A      B      C      D
2017-10-15  False   True  False  False
2017-10-16  False  False   True  False
2017-10-17  False  False  False  False
2017-10-18  False  False  False  False
2017-10-19  False  False  False  False
2017-10-20  False  False  False  False

In [82]:
np.any(df.isnull())==True#有任意一个缺失数据就返回True

True

In [83]:
df4.fillna(value=0)

             A     B     C   D
2017-10-15   0   0.0   2.0   3
2017-10-16   4   5.0   0.0   7
2017-10-17   8   9.0  10.0  11
2017-10-18  12  13.0  14.0  15
2017-10-19  16  17.0  18.0  19
2017-10-20  20  21.0  22.0  23

In [ ]:
'''
读取文件格式
read_csv
read_excel
read_hdf
read_sql
read_json
read_msgpack
read_html
read_gbp
read_stata
read_sas
read_clipboard
read_pickle
'''

In [ ]:
'''
存储文件格式
to_csv
to_excel
to_hdf
to_sql
to_json
to_msgpack
to_html
to_gbp
to_stata
to_sas
to_clipboard
to_pickle
'''

In [84]:
data=pd.read_csv('student.csv')

In [85]:
data

    Student ID name  age  gender
0         1100    A   22  female
1         1101    B   21    male
2         1102    C   25    male
3         1103    D   26    male
4         1104    E   24  female
5         1105    F   28    male
6         1106    G   25    male
7         1107    H   28  female
8         1108    I    4  female
9         1109    J   34    male
10        1110    K   35  female
11        1111    L   32    male
12        1112    M   42  female
13        1113    N   12    male

In [87]:
data.to_pickle('student.pickle')

In [89]:
ab1=pd.DataFrame(np.ones((3,4))*0,columns=['a','b','c','d'])
ab2=pd.DataFrame(np.ones((3,4))*1,columns=['a','b','c','d'])
ab3=pd.DataFrame(np.ones((3,4))*2,columns=['a','b','c','d'])

In [92]:
res=pd.concat([ab1,ab2,ab3],axis=0,ignore_index=True)#ignore_index用来忽略行的标号

In [93]:
res

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0
5  1.0  1.0  1.0  1.0
6  2.0  2.0  2.0  2.0
7  2.0  2.0  2.0  2.0
8  2.0  2.0  2.0  2.0

In [94]:
abc1=pd.DataFrame(np.ones((3,4))*0,columns=['a','b','c','d'],index=[1,2,3])
abc2=pd.DataFrame(np.ones((3,4))*1,columns=['a','b','d','e'],index=[2,3,4])

In [95]:
asd=pd.concat([abc1,abc2])

In [96]:
asd

     a    b    c    d    e
1  0.0  0.0  0.0  0.0  NaN
2  0.0  0.0  0.0  0.0  NaN
3  0.0  0.0  0.0  0.0  NaN
2  1.0  1.0  NaN  1.0  1.0
3  1.0  1.0  NaN  1.0  1.0
4  1.0  1.0  NaN  1.0  1.0

In [97]:
sdf=pd.concat([abc1,abc2],join='inner')

In [98]:
sdf

     a    b    d
1  0.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  0.0  0.0
2  1.0  1.0  1.0
3  1.0  1.0  1.0
4  1.0  1.0  1.0

In [99]:
dfg=pd.concat([abc1,abc2],join='inner',ignore_index=True)

In [100]:
dfg

     a    b    d
0  0.0  0.0  0.0
1  0.0  0.0  0.0
2  0.0  0.0  0.0
3  1.0  1.0  1.0
4  1.0  1.0  1.0
5  1.0  1.0  1.0

In [102]:
qwe=pd.concat([abc1,abc2],axis=1,join_axes=[abc1.index])

In [103]:
qwe

     a    b    c    d    a    b    d    e
1  0.0  0.0  0.0  0.0  NaN  NaN  NaN  NaN
2  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0
3  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0

In [104]:
wer=pd.concat([abc1,abc2],axis=1)

In [105]:
wer

     a    b    c    d    a    b    d    e
1  0.0  0.0  0.0  0.0  NaN  NaN  NaN  NaN
2  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0
3  0.0  0.0  0.0  0.0  1.0  1.0  1.0  1.0
4  NaN  NaN  NaN  NaN  1.0  1.0  1.0  1.0

In [109]:
cb1=pd.DataFrame(np.ones((3,4))*0,columns=['a','b','c','d'])
cb2=pd.DataFrame(np.ones((3,4))*1,columns=['a','b','c','d'])
cb3=pd.DataFrame(np.ones((3,4))*2,columns=['a','b','c','d'])
iop=cb1.append([cb2,cb3],ignore_index=True)

In [110]:
iop

     a    b    c    d
0  0.0  0.0  0.0  0.0
1  0.0  0.0  0.0  0.0
2  0.0  0.0  0.0  0.0
3  1.0  1.0  1.0  1.0
4  1.0  1.0  1.0  1.0
5  1.0  1.0  1.0  1.0
6  2.0  2.0  2.0  2.0
7  2.0  2.0  2.0  2.0
8  2.0  2.0  2.0  2.0